content/posts-org/aws_command_line_tips.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     AWS command line tips
#+AUTHOR:    Fei Ni
#+EMAIL:     fei.ni@helix.com
#+DATE:      2021-04-26
#+HUGO_CATEGORIES: helix
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here

* API Gateway
** Get API info from API name

#+begin_src bash
# get api_id
[fei.ni@fei-ni-C02D72XMMD6N-SM Developer-409670809604 cdk (feature/GENP-1217 *%)]$ aws apigateway get-rest-apis |grep -C2 -i SampleTracker|grep \"id\"
            "id": "f6q7nt5z6k",
[fei.ni@fei-ni-C02D72XMMD6N-SM Developer-409670809604 cdk (feature/GENP-1217 *%)]$ aws apigateway get-resources --rest-api-id f6q7nt5z6k
{
    "items": [
        {
            "id": "421gtq",
            "parentId": "myxmqijazg",
            "pathPart": "samples",
            "path": "/samples",
            "resourceMethods": {
                "OPTIONS": {}
            }
        },
        {
            "id": "9jjl41",
            "parentId": "421gtq",
            "pathPart": "import",
            "path": "/samples/import",
            "resourceMethods": {
                "OPTIONS": {},
                "POST": {}
            }
        },
        {
            "id": "myxmqijazg",
            "path": "/",
            "resourceMethods": {
                "ANY": {}
            }
        }
    ]
}
#+end_src
* Submit batch job
#+begin_src bash
[fei.ni@fei-ni-C02FG3R2MD6N-SM master-dev fei_work]$ cat job.json
{
    "jobName": "fei_test_r2v_new",
    "jobQueue": "arn:aws:batch:us-east-1:304674702989:job-queue/hipaa-exome-workflow-job-queue",
    "jobDefinition": "arn:aws:batch:us-east-1:304674702989:job-definition/r2v-batch-job:5",
    "containerOverrides": {
        "command": ["r2v","--platform","host","--json","s3://304674702989-hipaa-exome-workflow/test/fei/fei_test_r2v_run_cfg.json"]
    }
}

[fei.ni@fei-ni-C02FG3R2MD6N-SM master-dev fei_work]$ aws batch submit-job  --cli-input-json file://job.json
#+end_src
